Reports/20220116_175447/SOAP_CountryInfo_Testuite/20220116_175447/requests/main/4.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2022-01-16T15:55:08.137Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <web:CountryIntPhoneCode>\n         <web:sCountryISOCode>gero et</web:sCountryISOCode>\n      </web:CountryIntPhoneCode>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "private, max-age=0"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Vary",
          "value" : "Accept-Encoding"
        }, {
          "name" : "Web-Service",
          "value" : "DataFlex 19.1"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Sun, 16 Jan 2022 15:55:08 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "content" : {
          "size" : 392,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryIntPhoneCodeResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryIntPhoneCodeResult>Country not found in the database</m:CountryIntPhoneCodeResult>\r\n    </m:CountryIntPhoneCodeResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 165,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 0,
        "dns" : -1,
        "blocked" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "4",
        "testObjectId" : "Object Repository/SOAP Service/CountryInfoService/SOAP Service/CountryInfoServiceSoapBinding/CountryIntPhoneCode",
        "harId" : "72ed1173-d5e2-4ba7-9cc9-ddd4e77347e9",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}